app/Controllers/LoginControlador.php

SELECT *
FROM `usuario`
WHERE `email` = 'cristianbustos@alumnos.itr3.edu.ar'
 LIMIT 1
---
    public function loguearse()
    {
        $session = \Config\Services::session();
        $result = new UsuarioModelo();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $result->where('email', $email)->first();

        if ($user) {
            if (password_verify($password, $user['password'])) {
                $session->set('user_rol', $user['id_rol']);
                $session->set('user_id', $user['id_Usuario']);
                $session->set('name' , $user['nombre']);
                $session->set('email' , $user['email']);

                $redirect_url = $session->get('redirect_url') ?? 'pagina';