app/Controllers/RecepcionControlador.php

SELECT *
FROM `usuario`
WHERE `email` = 'test@test.org'
 LIMIT 1
---
    public function nuevoMed()
    {
        $session = \Config\Services::session();
        $HorarioModelo = new HorarioModelo();
        $UsuarioModelo = new UsuarioModelo();

        $id_Usuario = $this->request->getPost('id_Usuario');
        $name = $this->request->getPost('nombre');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $imagen = $this->request->getPost('imagen_ruta');
        $idEspecialidad = $this->request->getPost('especialidad');
        $id_rol = 4;
        $horarios = $this->request->getPost('horarios');

        // Verificar si el email ya está registrado
        $existingEmail = $UsuarioModelo->where('email', $email)->first();

SELECT *
FROM `usuario`
WHERE `usuario`.`id_Usuario` = '7'
SELECT *
FROM `especialidad`
WHERE `especialidad`.`id_Especialidad` = '41'
---
    public function perfilMedico()
    {
        $session = \Config\Services::session();
        $idUsuario = $session->get('user_id');
        $UsuarioModelo = new UsuarioModelo();
        $EspecialidadModelo = new EspecialidadModel();

        $medico = $UsuarioModelo->find($idUsuario);


        if (!$medico) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Médico no encontrado');
        }

        $especialidad = $EspecialidadModelo->find($medico['id_especialidad']);