app/Controllers/TurnoControlador.php

    public function index(){
        $session = \Config\Services::session();
        $turnoModel = new TurnoModel();
        $pacienteModel = new PacienteModel();
        $usuarioModel = new UsuarioModelo();
        $estadoModel = new EstadoModel();
        $HorarioModel = new HorarioModelo();

        $userId = $session->get('user_id');
        $userRol = $session->get('user_rol');
        $user = $pacienteModel->find($userId);
        $estados = $estadoModel->findAll();
        $horarios = $HorarioModel->findAll();
        $idPaciente = $pacienteModel->getPacientePorUsuarioID($userId);
        if ($userRol == 1) { // Usuario - Paciente
            $turnos = $turnoModel->where('id_paciente', $idPaciente['id_Paciente'])->findAll();
        } elseif ($userRol == 2) { //Admin
            $turnos = $turnoModel->findAll();
        } elseif ($userRol == 3) { // Recepcion
            $turnos = $turnoModel->findAll();
        } elseif ($userRol == 4) { // Medico
            $turnos = $turnoModel->where('id_Usuario', $userId)->findAll();
        }

        $estadosMap = [];
        foreach ($estados as $estado) {
            $estadosMap[$estado['id_Estado']] = $estado['estado'];
        }
        $usuariosTurnos = [];
        foreach ($turnos as $turno) {
            $usuariosTurnos[$turno['id_Usuario']] = $usuarioModel->find($turno['id_Usuario']);
        }
        $pacienteTurnos = [];
        foreach ($turnos as $turno){
            $pacienteTurnos[$turno['id_paciente']] = $pacienteModel->find($turno['id_paciente']);
        }

        foreach ($turnos as &$turno) {
            $paciente = $pacienteModel->find($turno['id_paciente']);
---
SELECT *
FROM `estado`
SELECT *
FROM `paciente`
WHERE `paciente`.`id_Paciente` = '7'
SELECT *
FROM `turno`
WHERE `id_Usuario` = '7'
SELECT *
FROM `usuario`
WHERE `usuario`.`id_Usuario` = '7'
SELECT *
FROM `paciente`
WHERE `paciente`.`id_Paciente` = '21'