app/Models/DetPagoModelo.php

    public function insertarDatos($dato){
        $query = $this->db->table($this->table)->insert($dato);
---
INSERT INTO `det_pago` (`id_metodop`, `monto`, `id_Usuario`) VALUES ('1', 5000, '6')