app/Models/PacienteModel.php

SELECT *
FROM `paciente`
WHERE `id_Paciente` = '6'
 LIMIT 1
---
    public function getPaciente($id = false)
    {
        if ($id === false) {
            return $this->findAll() ? $this->findAll() : [];
        } else {
            return $this->where(['id_Paciente' => $id])->first() ? $this->where(['id_Paciente' => $id])->first() : [];

SELECT *
FROM `paciente`
WHERE `id_Usuario` = '7'
 LIMIT 1
---
    public function getPacientePorUsuarioID($id = false)
    {
        if ($id === false){
            return redirect()->to('error');
        } else {
            return $this->where(['id_Usuario' => $id])->first() ? $this->where(['id_Usuario' => $id])->first() : [];