app/Models/TurnoModel.php

INSERT INTO `turno` (`fecha_hora`, `codigo_turno`, `id_Usuario`, `id_paciente`, `id_estado`) VALUES ('2', '7bf3ee59', '7', '21', 1)
---
    public function insertarDatos($data){
        $query = $this->db->table($this->table)->insert($data);

SELECT *
FROM `turno`
WHERE `id_Usuario` = '6'
---
    public function getTurnosPorUsuario($userId) {
        return $this->where('id_Usuario', $userId)->findAll();